src/cf/src/Documents/ПоступлениеИзПереработки/ПоступлениеИзПереработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеИзПереработки</name>
  <basedOn>Document.ПередачаВПереработку</basedOn>
  <registerRecords>AccumulationRegister.ТоварыВНаличии</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыВПереработке</registerRecords>
  <registerRecords>AccumulationRegister.ВзаиморасчётыСПоставщиками</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПередачаВПереработку</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьУслуг</name>
    <comment>Без НДС; включается в себестоимость готовой продукции</comment>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ВВалюте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>КурсВалюты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДСУслуг</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДСУслуг</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СырьеИзмененоВручную</name>
    <comment>Строки сырья правили руками, а не расчётом по продукции: рабочее место производства строки документа не правит</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧГотоваяПродукция</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентПотерь</name>
      <type>
        <types>DefinedType.Процент</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьУслуг</name>
      <comment>Услуги переработчика без НДС, приходящиеся на строку; шапка документа - сумма строк</comment>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/AccumulationRegisters/ТоварыВНаличии/ТоварыВНаличии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыВНаличии</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <attributes>
    <name>Комплект</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХранения</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>DefinedType.ПриходныйДокументПартии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПартии</name>
    <comment>Реквизит для ускорения выборки по FIFO</comment>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/AccumulationRegisters/ВзаиморасчётыСПоставщиками/ВзаиморасчётыСПоставщиками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВзаиморасчётыСПоставщиками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <resources>
    <name>СуммаВВалюте</name>
    <type>
      <types>DefinedType.Сумма</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРасчётов</name>
    <type>
      <types>DocumentRef.СписаниеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.КорректировкаДолга</types>
      <types>DocumentRef.РасходныйКассовыйОрдер</types>
      <types>DocumentRef.ПоступлениеБезналичныхДенежныхСредств</types>
      <types>DocumentRef.ПриходныйКассовыйОрдер</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.ПоступлениеДополнительныхРасходов</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.НалоговаяНакладнаяПокупка</types>
      <types>DocumentRef.ПоступлениеИзПереработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/cf/src/Documents/ПоступлениеИзПереработки/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	РаботаСДокументами.ЗаполнитьРеквизитыПоУмолчанию(ЭтотОбъект);
	СтавкаНДСУслуг = Константы.СтавкаНДСПоУмолчанию.Получить();
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПередачаВПереработку") Тогда
		ЗаполнитьПоПередаче(ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	// Наборы очищаются явно: объект, проведённый в этом же экземпляре (повторное «Провести» в открытой форме,
	// перепроведение в сценарии), держит в памяти движения прошлого проведения, а СписатьНоменклатуру их не
	// чистит, а ДОПИСЫВАЕТ свои. Без очистки второе проведение уводит остатки в минус на объём документа (S5-A).
	Для Каждого НаборЗаписей Из Движения Цикл
		НаборЗаписей.Очистить();
	КонецЦикла;
	РаботаСДокументами.УстановитьЗаписьВсехРегистров(Движения);
	// Данные для проведения: списываемое у переработчика сырьё
	ДополнительныеСвойства.Вставить("ТЗТоварыССериями", СерииИРазмещение.ОбъединитьТоварыССериями(ЭтотОбъект));
	// Блокировки: остатки у переработчика и склад, на который приходуется продукция
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка);
	Блокировка.Заблокировать();
	// Формируем: расход у переработчика и приход продукции - в диспетчере ТоварыВНаличии
	Если Не РегистрыНакопления.ТоварыВНаличии.СформироватьДвижения(ЭтотОбъект) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	// Долг перед переработчиком на стоимость его услуг
	РегистрыНакопления.ВзаиморасчётыСПоставщиками.СформироватьДвижения(ЭтотОбъект);
	Движения.Записать();
	// Продукция переработчика - выпуск заказа: стадии заказов пересчитываются последними (E8, E12.3b).
	ПроизводственныеЗаказы.ОбновитьСтадииПослеПроведения(ЭтотОбъект);
КонецПроцедуры

// Отмена проведения поступления по заказу на производство: блокировки в порядке проведения, очистка движений и пересчёт
// стадий заказа (E8, E12.3b). Без таких заказов движения удаляет платформа, как раньше.
//
// Параметры:
//  Отказ - Булево - не используется.
//
Процедура ОбработкаУдаленияПроведения(Отказ)
	Блокировка = Новый БлокировкаДанных;
	ЗаполнитьБлокировкуПроведения(Блокировка);
	ПроизводственныеЗаказы.ОтменитьПроведениеДокумента(ЭтотОбъект, Блокировка);
КонецПроцедуры

// Блокировки проведения и отмены проведения - один набор в одном порядке (E8): ТоварыВНаличии перед
// ТоварыВПереработке, одинаково со всеми документами контура.
//
// Порядок развёрнут в S4-B. До него поступление брало регистры встречно к передаче, и встреча требовала
// совпадения склада и строк табличной части. Передача с автовыпуском расширила свой элемент ТоварыВНаличии со
// «склад + строки» до «вся номенклатура строк и автовыпуска без склада», и окно взаимной блокировки
// «поступление по одной передаче против проведения следующей» выросло бы кратно.
//
// Параметры:
//  Блокировка - БлокировкаДанных - заполняемая блокировка.
//
Процедура ЗаполнитьБлокировкуПроведения(Блокировка)
	// Набор строит менеджер: его же берёт рабочее место производства перед пересчётом сырья (S6).
	Документы.ПоступлениеИзПереработки.ЗаполнитьБлокировкуПроведения(Блокировка, ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ТипЗнч(Основание) = Тип("ДокументСсылка.ПередачаВПереработку") И ЗначениеЗаполнено(Основание)
		И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Основание, "Контрагент") <> Контрагент Тогда
		ТекстОшибки = НСтр("ru = 'Переработчик отличается от переработчика в передаче-основании';
			|fr = 'Le sous-traitant diffère de celui du transfert de base';
			|en = 'The processor differs from the processor in the basis transfer';
			|es = 'El procesador difiere del procesador en la transferencia base'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "Контрагент", , Отказ);
	КонецЕсли;
	ПроверитьСписаниеБезПрихода(Отказ);
КонецПроцедуры

// Сырьё без продукции - документ, который списывает стоимость в никуда.
//
// Расход у переработчика сформируется, а приходовать будет нечего: РаспределитьСебестоимостьНаПродукцию
// не выполнит ни одной итерации, и стоимость списанного сырья исчезнет из учёта. Законного случая нет -
// возвратного документа из переработки в конфигурации не существует, ТЧТовары поступления только
// списывает с регистра ТоварыВПереработке.
//
// Обратная пара - продукция без сырья - НЕ проверяется. Она бывает законной: после того как порог
// дочистки забрал весь остаток предыдущим поступлением, приёмка хвоста продукции идёт с нулевым сырьём, и
// нулевая себестоимость у неё верна - стоимость ушла в предыдущий документ. Сомнительный случай (сырья
// нет потому, что заполнение не нашло остатков) ловится раньше и мягче - сообщением при заполнении, см.
// ЗаполнитьПоПередаче.
//
// Это не та проверка, от которой сборка отказалась в B.5: та сверяла бы фактическое количество сырья с
// расчётным и срабатывала бы почти на каждом перепроведении документов, заполненных до S5-B. Здесь
// сравнения с расчётом нет.
//
// Параметры:
//  Отказ - Булево - признак отказа записи.
//
Процедура ПроверитьСписаниеБезПрихода(Отказ)
	Если ТЧТовары.Количество() > 0 И ТЧГотоваяПродукция.Количество() = 0 Тогда
		ТекстОшибки = НСтр("ru = 'Списывается сырьё, но не приходуется продукция: стоимость сырья пропадёт из учёта';
			|fr = 'Des matières sont sorties sans entrée de produits : leur valeur disparaîtrait de la comptabilité';
			|en = 'Materials are written off without any product received: their value would vanish from accounting';
			|es = 'Se dan de baja materias sin entrada de productos: su valor desaparecería de la contabilidad'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, ЭтотОбъект, "ТЧГотоваяПродукция", , Отказ);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.Пользователь;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.МожноРедактироватьДокумент(ЭтотОбъект, Отказ);
	Если Не Отказ Тогда
		// Услуги переработчика живут в строках продукции, шапка - их сумма (S6).
		Документы.ПоступлениеИзПереработки.СинхронизироватьСтоимостьУслуг(ЭтотОбъект);
		ПроизводственныеЗаказы.ЗапомнитьЗаказыДокумента(ЭтотОбъект, РежимЗаписи);
	КонецЕсли;
	// Услуги переработчика в валюте: без курса не записывается, сумма с НДС - в основной валюте по курсу.
	РаботаСВалютами.ПроверитьВалютуДокумента(ЭтотОбъект, Отказ);
	СуммаРегл = РаботаСВалютамиКлиентСервер.СуммаРегл(СтоимостьУслуг, КурсВалюты)
		+ РаботаСВалютамиКлиентСервер.СуммаРегл(СуммаНДСУслуг, КурсВалюты);
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	РаботаСДокументами.ОбновитьПроизводственныйСтатусЗаказа(ЭтотОбъект);
	// Проведённый документ, перезаписанный без перепроведения, пересчитывает стадии своих заказов (E8).
	ПроизводственныеЗаказы.ОбновитьСтадииПриЗаписи(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполнение по передаче-основанию: сначала продукция, потом сырьё под неё.
//
// Порядок обязателен. До S5-B в сырьё уходил весь остаток передачи у переработчика, и продукция считалась
// отдельно; теперь расход сырья считается ОТ принятой продукции по технологическим картам
// (см. Документы.ПоступлениеИзПереработки.СырьеПоПродукции), и продукция должна быть готова раньше.
//
// Параметры:
//  Передача - ДокументСсылка.ПередачаВПереработку - передача-основание.
//
Процедура ЗаполнитьПоПередаче(Передача)
	Реквизиты = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Передача, "Контрагент,Организация,МестоХранения");
	Основание = Передача;
	Контрагент = Реквизиты.Контрагент;
	Организация = Реквизиты.Организация;
	МестоХранения = Реквизиты.МестоХранения;
	// Ожидаемая продукция за вычетом поступившей - правило менеджера, общее с рабочим местом производства (S6).
	ТЧГотоваяПродукция.Загрузить(Документы.ПоступлениеИзПереработки.ОжидаемаяПродукция(Передача, Ссылка));
	ЗаполнитьПроцентыПотерь();
	Для Каждого Стр Из ТЧГотоваяПродукция Цикл
		Стр.КодСтроки = РаботаСДокументамиКлиентСервер.ПолучитьСледующийКодСтроки(ТЧГотоваяПродукция);
	КонецЦикла;
	Документы.ПоступлениеИзПереработки.ЗаполнитьСырье(ЭтотОбъект, Передача);
	Если ТЧГотоваяПродукция.Количество() > 0 И ТЧТовары.Количество() = 0 Тогда
		// Продукцию ждём, а сырья у переработчика на дату документа нет. Бывает законно (порог дочистки
		// забрал остаток предыдущим поступлением), но бывает и ошибкой ввода: дата документа раньше даты
		// передачи либо передача ещё не проведена. Молчать здесь нельзя - пустая таблица сырья означает
		// продукцию с нулевой себестоимостью, а заметить пустую таблицу пользователь может и не сразу.
		ТекстСообщения = НСтр("ru = 'Сырья этой передачи у переработчика на дату документа нет: продукция придёт
			|с нулевой себестоимостью. Проверьте дату документа и проведена ли передача';
			|fr = 'Aucune matière de ce transfert chez le sous-traitant à la date du document : les produits
			|entreraient à coût nul. Vérifiez la date et la validation du transfert';
			|en = 'No materials of this transfer are held at the processor as of the document date: the products
			|would be received at zero cost. Check the document date and whether the transfer is posted';
			|es = 'No hay materias de esta transferencia en el procesador en la fecha del documento: los productos
			|entrarían con coste cero. Revise la fecha y si la transferencia está contabilizada'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, "ТЧТовары");
	КонецЕсли;
КонецПроцедуры

// Процент потерь строк продукции - средневзвешенный по технологической карте на дату документа.
// Процент записывается В ДОКУМЕНТ, а не читается из карты при проведении: правка карты не должна менять
// деньги уже принятого поступления (тот же довод, по которому нормы читаются на дату документа).
// Позиция без карты остаётся с нулём - порога дочистки у неё нет, и крошка висит, как до S5-B.
//
Процедура ЗаполнитьПроцентыПотерь()
	Если ТЧГотоваяПродукция.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Проценты = ТехнологическиеКарты.ПроцентыПотерьТехкарт(ТЧГотоваяПродукция.ВыгрузитьКолонку("Номенклатура"), Дата);
	Для Каждого Стр Из ТЧГотоваяПродукция Цикл
		Процент = Проценты[Стр.Номенклатура];
		Стр.ПроцентПотерь = ?(Процент = Неопределено, 0, Процент);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
